## 3. Data pre-processing

### 3.0 Import Essential Libraries

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from pandas import Series, DataFrame

라이브러리 항상 가져와야함
위에 3개는 항상 필수적
improt as vs from import
Series DataFrame 데이터형태가 중요해서 pandas에서 불러옴
pd.Series .. 이렇게 써야하지만 항상 default 로 쓸거기 떄문에 from pands 이런꼴로 씀

### 3.1 Data Loading & Storage

#### 3.1.1 Reading in Delimited Format

= 데이터가 나누어져있다
csv 파일 , txt, excel 파일
csv가 자주 사용되는 이유 : txt 는 data를 string 형태로 가져와 
스페이스가 있으면 데이터 나누어져 있는 거다 알려주는 거->delimited
ex 1 2 3 4 5 
csv는 콤마가 아이템 나눠줌

In [3]:
df=pd.read_csv('IDA_03_PREP_data/03_01.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

df => dataframe 의 약자
csv 데이터 어떤 형태인지 쉽개 알 수 있음

In [4]:
print("Loaded DataFrame:\n{}\n".format(df))

Loaded DataFrame:
   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('IDA_03_PREP_data/03_01.csv')

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

따라서 제대로 불러올려면  Delimited 이 콤마라서 콤마로 나눠줘야함

read_csv , read_table 차이점 

- read_csv : 다 분리시켜줌
- read_tabel : 분리 시켜줘야함

In [13]:
pd.read_table('IDA_03_PREP_data/03_01.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
pd.read_csv('IDA_03_PREP_data/03_02.csv')
# 지금 헤더를 없애야함..
# header = None

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [19]:
pd.read_csv('IDA_03_PREP_data/03_02.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

헤더를 없앨러면 header=None 해주면됨
헤딩에 딴거 names 붙일수도 있음 하지만 None 으로 하는 거 추천

In [20]:
pd.read_csv('IDA_03_PREP_data/03_02.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
list(open('IDA_03_PREP_data/03_03.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [22]:
pd.read_table('IDA_03_PREP_data/03_03.txt', sep='\s+')

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [23]:
df_03_03_01 = pd.read_csv('IDA_03_PREP_data/03_04.csv')
df_03_03_01

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [25]:
print("What is NaN ? \n{}\n".format(pd.isnull(df_03_03_01)))
# pd.isnull() 은 NaN 이면 true

What is NaN ?
   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [28]:
df_03_04_01 = pd.read_csv('IDA_03_PREP_data/03_04.csv', na_values=['world','foo'])
df_03_04_01
# na_values = ['',''] 은 ' ' 안에 있는 값 NaN 으로 만들어버림

  something  a   b     c   d  message
0       one  1   2   3.0   4      NaN
1       two  5   6   NaN   8      NaN
2     three  9  10  11.0  12      NaN

In [29]:
# 한꺼번에 NaN 으로 만들기도 가능 => dictionary 형태로
df_03_04_02 = pd.read_csv('IDA_03_PREP_data/03_04.csv',na_values={'something':['one','three'],
                                                                 'message':['foo']})
df_03_04_02

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2       NaN  9  10  11.0  12     NaN

테이블이 너무 더러우면,
1. 데이터 작을때는 엑셀로 데이터 처리
2. 데이터 많으면, (엑셀 row 제한) 파이썬 작업

없는 값 가져오면 NaN 으로 갖고와..
dataframe 은 dictionary 형태

In [42]:
df_03_05_01=pd.read_csv('IDA_03_PREP_data/03_05.csv',header=0, nrows=5)
df_03_05_01

# 데이터가 클때는 nrows 써주기

,Unnamed: 0,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
2,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0

데이터 형태 빠르게 캐취하기 위해 nrows 써서 데이터 파악함 (조금만 불러옴)
헤딩은 데이터 정보를 지정하는 변수들 따라서 줄일 필요 없음 
그리고 row는 사람과 비유하면 됨. 0번 사람 1번 사람 그래서 nrows 를 많이 사용함
ncolumn 은 별로 안씀

In [43]:
df_03_05_01=pd.read_csv('IDA_03_PREP_data/03_05.csv',header=1,nrows=5)
df_03_05_01
# header = 0 이 default
# 위에 표는 header 0 이면 x1 이런거나옴
# 실제 필요한건 1에 있음 따라서 header =1 => heading 지정 필요

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [44]:
import sys

In [57]:
df_03_04_02.to_csv('IDA_03_PREP_data/03_05_out1.csv',na_rep='NULL',index=False,columns=['b','c'])
#pd.read_csv('IDA_03_PREP_data/03_05_out1.csv')

# na_rep = 'NULL' 하면 csv 파일에 NULL 값이 들어감
# header 는 보통 살려둠
# columns = [' ',' '] => ' ',' ' 만 가져와라

# 하지 않으면 그냥 빈칸
# pd.read_csv 결과는 똑같음

# Merging & Transform

## pandas.merge vs pandas.concat

- pandas.merge => key 값으로 찾아줌
- pandas.concat => 붙여주기

In [63]:
import pandas as pd
from pandas import Series, DataFrame

df_321_1 = DataFrame({'key': ['b','b','a','c','a','a','b'],
                     'data1':range(7)})
df_321_2 = DataFrame({'key' : ['a','b','d'],
                     'data2':range(3)})
print("df_321_1 : \n{}\n".format(df_321_1))
print("df_321_2 : \n{}\n".format(df_321_2))

df_321_1 :
  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

df_321_2 :
  key  data2
0   a      0
1   b      1
2   d      2

### pd.merge 란 key 값을 통해 합쳐

In [65]:
pd.merge(df_321_1,df_321_2, on='key')
# default 상황

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

쉽게 생각해서 그냥 key에 대한 merge 를 하게 해주면 최종적으로 나오는 key 값은

=> 교집합이라 생각하자

ex) 
- 1에서 key는 b,a,c 가있고 2에서 key는 b,a,d가 있다
- 결과가 b,a 만 있다
- 2 그래프에서 b의 값은 1 이다.

In [66]:
df_321_3 = DataFrame({'lkey':['b','b','a','c','a','a','b'],
                     'data1':range(7)})
df_321_4 = DataFrame({'rkey':['a','b','d'],
                     'data2':range(3)})
print("df_321_3 : \n{}\n".format(df_321_3))
print("df_321_4 : \n{}\n".format(df_321_4))

df_321_3 :
  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

df_321_4 :
  rkey  data2
0    a      0
1    b      1
2    d      2

In [67]:
pd.merge(df_321_3,df_321_4,left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [85]:
pd.merge(df_321_3,df_321_4,left_index=True,right_index=True)

  lkey  data1 rkey  data2
0    b      0    a      0
1    b      1    b      1
2    a      2    d      2

key 이름이 서로 다를 때는 

- 1. key 이름을 다르게 하거나
- 2. left_on, right_on 을 써준다

< detail >

- inner join
- outer join
- left
- right

In [68]:
pd.merge(df_321_3,df_321_4,left_on='lkey',right_on='rkey',how='outer')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

## merger argument

- left
- right
- how
- on
- left_on
- rignt_on
- left_index
- rignt_index
- sort
- suffixes
- copy

In [72]:
a =pd.merge(df_321_3,df_321_4,left_on='lkey',right_on='rkey')
a

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [76]:
df_321_5 = DataFrame({'key':['a','b','a','a','b','c'],
                     'value':[0,1,2,3,4,5]})

df_321_6 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [78]:
print("dataframe 321_5 is \n{}\n".format(df_321_5))
print("dataframe 321_6 is \n{}\n".format(df_321_6))

dataframe 321_5 is
  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

dataframe 321_6 is
   group_val
a        3.5
b        7.0

In [83]:
pd.merge(df_321_5, df_321_6, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [91]:
b = pd.merge(df_321_5, df_321_6, left_on='key', right_index=True, how='outer')
b

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [90]:
b.iloc[3][2]

7.0

### 둘다 인덱스 사용하는 경우

In [96]:
df_321_7 = DataFrame([[1., 2.], [3., 4.], [5., 6.]], 
                      index=['a', 'c', 'e'], 
                      columns=['Ohio', 'Nevada']) 
df_321_8 = DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]], 
                     index=['b', 'c', 'd', 'e'], 
                     columns=['Missouri', 'Alabama']) 

print("data frame 321_7 : \n{}\n".format(df_321_7))
print("data frame 321_8 : \n{}\n".format(df_321_8))
pd.merge(df_321_7, df_321_8, left_index=True, right_index=True, how='outer')

data frame 321_7 :
   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

data frame 321_8 :
   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

### concat

In [103]:
s_321_9 = Series([0,1], index=['a','b'])
s_321_10 = Series([2,3,4], index=['c','d','e'])
s_321_11 = Series([5,6], index=['f','g'])
pd.concat([s_321_9,s_321_10,s_321_11], axis=1,sort=True)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

### drop duplicates

In [112]:
df_322_1 = DataFrame({'k1':['one']*3 + ['two']*4,
                    'k2':[1,1,2,3,3,4,4]})
print("df_32_1 : \n{}\n".format(df_322_1))
print("drop duplicates :\n{}\n".format(df_322_1.drop_duplicates()))
print("drop duplicates :\n{}\n".format(df_322_1.drop_duplicates().reindex(range(6))))

df_32_1 :
    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

drop duplicates :
    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

drop duplicates :
    k1   k2
0  one  1.0
1  NaN  NaN
2  one  2.0
3  two  3.0
4  NaN  NaN
5  two  4.0

reindex 할때 nan 안생기게 하려면?

In [114]:
df_322_1['k3']=range(7)
print("df_321_7 (modified) :\n{}\n".format(df_322_1))
print("Eliminate duplicate based on k1 :\n{}\n".format(df_322_1.drop_duplicates(['k1'])))

df_321_7 (modified) :
    k1  k2  k3
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

Eliminate duplicate based on k1 :
    k1  k2  k3
0  one   1   0
3  two   3   3

가장 첫번째 것들만 살아남음

In [116]:
df_322_1.drop_duplicates(['k1','k2'])

    k1  k2  k3
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [117]:
df_322_1.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  k3
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

keep = 'last' 하면 뒤에것들이 삭제됨

In [118]:
df_322_2 = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 
                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]}) 
df_322_2

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [119]:
df_322_3 = {'bacon': 'pig','pulled pork': 'pig','pastrami': 'cow', 
            'corned beef': 'cow','honey ham': 'pig','nova lox': 'salmon'}
df_322_3

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [122]:
df_322_2['Source']=df_322_2['food'].map(str.lower).map(df_322_3)
df_322_2

          food  ounces  Source
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### replacing value

In [123]:
s_322_3 = Series([1.,-999.,2.,-999.,-1000.,3.])
s_322_3

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [128]:
s_322_3.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [129]:
s_322_3.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [130]:
s_322_3.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### detecting and filter outliers

In [131]:
np.random.seed(12345)
df_322_4 = DataFrame(np.random.randn(1000,1))
df_322_4.describe()

                 0
count  1000.000000
mean     -0.002351
std       0.979956
min      -2.949343
25%      -0.683671
50%      -0.010074
75%       0.630230
max       3.927528

In [135]:
df_322_4[(np.abs(df_322_4)>np.std(df_322_4)*3).any(1)]

            0
22   3.248944
391  3.927528
410  3.176873
521 -2.949343

## 중요

- any(1) True 값 다 갖고와줘..
- 없애고 싶으면 drop or replace

In [139]:
df_322_5 = DataFrame(np.arange(5*4).reshape(5,4))
print("df_322_5 : \n{}\n".format(df_322_5))

df_322_5 :
    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [140]:
df_322_6 = np.random.permutation(5)
print("df_322_6 : \n{}\n".format(df_322_6))

df_322_6 :
[0 2 1 3 4]

In [141]:
df_322_5.take(df_322_6)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

- np.random.permutation()
- take